import random           #乱数用
import os               #コンソール操作用
import Status as Stas   #自作モジュールのインポート


# #定数群
# NPC_NOB

{
("織田信長", 10000, 800, 400, 200, 1200, 2000, 300, 50, 14700),
("豊臣秀吉", 10000, 500, 750, 375, 1250, 1750, 300, 57, 14550),
("徳川家康", 10000, 700, 350, 175, 1050, 1750, 300, 57, 14150),
("今川義元", 10000, 400, 600, 300, 1000, 1400, 300, 71, 13700),
("武田信玄", 10000, 600, 300, 150, 900,  1500, 300, 66, 13600),
("明智光秀", 10000, 900, 450, 225, 1350, 2250, 300, 44, 15250) 
}


#グローバル変数群
gPlayer = Stas.clsStatus()

#表示されている画面を奇麗にする
def dispClear():
    os.system("cls")

#メイン関数
def Main():
    dispClear()
    
    gPlayer.setDatas("aa", 1, 2, 3)
    gPlayer.dispDatas()

#エントリーポイント
if __name__ == "__main__":
    Main()
